import 'package:flutter/material.dart';

class Introduction extends StatefulWidget {
  @override
  _IntroductionState createState() => _IntroductionState();
}

class _IntroductionState extends State<Introduction> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('小店简介'),
      ),
      body: ListView(
        children: <Widget>[
          Container(
            padding: EdgeInsets.all(32.0),
            child: Text(
              '''
          聚美优品是一家化妆品限时特卖商城，其前身为团美网，由陈欧、戴雨森等创立于2010年3月。聚美优品首创“化妆品团购”模式：每天在网站推荐十几款热门化妆品。2010年9月，团美网正式全面启用聚美优品新品牌，并且启用全新顶级域名。
          聚美优品坚持只从品牌厂家、正规代理商、国内外专柜等可信的进货渠道采购商品，并在采购部专门设置自己的质检员。让消费者拥有良好的服务体验，进而取得消费者的信任。从2010年3月成立至今，凭借口碑传播，短短一年半就从月销售额不足10万元发展到当月销售上亿元的规模。聚美优品拥有5000万注册用户，占女性化妆品团购市场份额的80%以上。
          与常规的团购有所不同，聚美优品的信息发布客户是自己，即自建渠道、仓储和物流，销售化妆品。严格意义上说，它是采取团购形式的垂直类女性化妆品B2C。从创业之初聚美优品的理念就很清晰，就是要做女性化妆品正品折扣网店。
          电子商务在迅猛发展，网购化妆品市场规模持续增大，虽然前景和市场都是相当的客观，但是仍然存在很多的问题，假冒伪劣充斥了整个网络，不仅恶化了消费环境，还严重影响了消费者对网络购物的信心，如何让化妆品电商行业更加的规范化、合法化、成熟化这是化妆品行业首要解决的问题。提高消费者对网购的信任度，才会使整个行业朝着更健康的方向发展。
          聚美优品CEO陈欧在微博上面透露，2013年聚美优品将会携手各大化妆品品牌在全国大力开设聚美线下旗舰店，他说“因为电子商务开设门槛太低，消费者对于线上化妆品有种天然的不信任，选择此时切入线下，将有利于解决消费者信任的问题。”此次聚美优品即将开创中国垂直美妆类B2C正式布局O2O的先例，再次引来业界的广泛关注。此次线下旗舰店的尝试，除了聚美优品品牌形象的展示外，更多考虑是用户的层面，拉近与用户的距离，弥补用户网购体验不足的缺憾，提升品牌的溢价能力。
              ''',
              softWrap: true,
            ),
          )
        ],
      ),
    );
  }
}
